[Killed] BlockStatement
src/CessarEncryption.ts:12:33
   encryption: number,
   mode: string
 ): string {
-  if (typeof word !== 'string') {
-    return ''
-  } else {
+  if (typeof word !== 'string') {} else {
     if (mode === 'encrypt') {
       const WordToArry = word.split('')
killedBy: cesarEncryption  Transform [1,1,1] y [1,1,1] in [bbb]
statusReason: expected undefined to deeply equal ''

[Killed] EqualityOperator
src/CessarEncryption.ts:12:7
   encryption: number,
   mode: string
 ): string {
-  if (typeof word !== 'string') {
+  if (typeof word === 'string') {
     return ''
   } else {
killedBy: cesarEncryption  cesarEncryption [a,a,a] y 1 in bbb
statusReason: expected '' to deeply equal 'bbb'

[Killed] BlockStatement
src/CessarEncryption.ts:14:10
 ): string {
   if (typeof word !== 'string') {
     return ''
-  } else {
-    if (mode === 'encrypt') {
-      const WordToArry = word.split('')
-      const CodedWord: string[] = []
-      for (let i = 0; i < WordToArry.length; i++) {
-        const numeberToLetter = moveNPlace(WordToArry[i], encryption)
-
-        const codedLetter = converNumberToString(numeberToLetter)
-        CodedWord.push(codedLetter)
-      }
-      return CodedWord.join('')
-    } else if (mode === 'decrypt') {
-      const WordToArry = word.split('')
-      const CodedWord: string[] = []
-      for (let i = 0; i < WordToArry.length; i++) {
-        const numeberToLetter = moveNPlaceReverse(WordToArry[i], encryption)
-
-        const codedLetter = converNumberToString(numeberToLetter)
-        CodedWord.push(codedLetter)
-      }
-      return CodedWord.join('')
-    } else {
-      return ''
-    }
-  }
+  } else {}
 }
 
killedBy: cesarEncryption  cesarEncryption [a,a,a] y 1 in bbb
statusReason: expected undefined to deeply equal 'bbb'

[Killed] ConditionalExpression
src/CessarEncryption.ts:15:9
   if (typeof word !== 'string') {
     return ''
   } else {
-    if (mode === 'encrypt') {
+    if (true) {
       const WordToArry = word.split('')
       const CodedWord: string[] = []
killedBy: cesarEncryption  cesarEncryption [a,a,a] y 1 in bbb
statusReason: expected 'ccc' to deeply equal 'aaa'

[Killed] ConditionalExpression
src/CessarEncryption.ts:15:9
   if (typeof word !== 'string') {
     return ''
   } else {
-    if (mode === 'encrypt') {
+    if (false) {
       const WordToArry = word.split('')
       const CodedWord: string[] = []
killedBy: cesarEncryption  cesarEncryption [a,a,a] y 1 in bbb
statusReason: expected '' to deeply equal 'bbb'

[Killed] StringLiteral
src/CessarEncryption.ts:16:37
     return ''
   } else {
     if (mode === 'encrypt') {
-      const WordToArry = word.split('')
+      const WordToArry = word.split("Stryker was here!")
       const CodedWord: string[] = []
       for (let i = 0; i < WordToArry.length; i++) {
killedBy: cesarEncryption  cesarEncryption [a,a,a] y 1 in bbb
statusReason: expected 'a' to deeply equal 'bbb'

[Killed] BlockStatement
src/CessarEncryption.ts:18:51
     if (mode === 'encrypt') {
       const WordToArry = word.split('')
       const CodedWord: string[] = []
-      for (let i = 0; i < WordToArry.length; i++) {
-        const numeberToLetter = moveNPlace(WordToArry[i], encryption)
-
-        const codedLetter = converNumberToString(numeberToLetter)
-        CodedWord.push(codedLetter)
-      }
+      for (let i = 0; i < WordToArry.length; i++) {}
       return CodedWord.join('')
     } else if (mode === 'decrypt') {
killedBy: cesarEncryption  cesarEncryption [a,a,a] y 1 in bbb
statusReason: expected '' to deeply equal 'bbb'

[Killed] EqualityOperator
src/CessarEncryption.ts:25:16
         CodedWord.push(codedLetter)
       }
       return CodedWord.join('')
-    } else if (mode === 'decrypt') {
+    } else if (mode !== 'decrypt') {
       const WordToArry = word.split('')
       const CodedWord: string[] = []
killedBy: cesarEncryption  cesarEncryption [a,a,a] y 1 in bbb
statusReason: expected '' to deeply equal 'aaa'

[Killed] ConditionalExpression
src/CessarEncryption.ts:25:16
         CodedWord.push(codedLetter)
       }
       return CodedWord.join('')
-    } else if (mode === 'decrypt') {
+    } else if (false) {
       const WordToArry = word.split('')
       const CodedWord: string[] = []
killedBy: cesarEncryption  cesarEncryption [a,a,a] y 1 in bbb
statusReason: expected '' to deeply equal 'aaa'

[Killed] BlockStatement
src/CessarEncryption.ts:28:51
     } else if (mode === 'decrypt') {
       const WordToArry = word.split('')
       const CodedWord: string[] = []
-      for (let i = 0; i < WordToArry.length; i++) {
-        const numeberToLetter = moveNPlaceReverse(WordToArry[i], encryption)
-
-        const codedLetter = converNumberToString(numeberToLetter)
-        CodedWord.push(codedLetter)
-      }
+      for (let i = 0; i < WordToArry.length; i++) {}
       return CodedWord.join('')
     } else {
killedBy: cesarEncryption  cesarEncryption [a,a,a] y 1 in bbb
statusReason: expected '' to deeply equal 'aaa'

[NoCoverage] BlockStatement
src/CessarEncryption.ts:35:12
         CodedWord.push(codedLetter)
       }
       return CodedWord.join('')
-    } else {
-      return ''
-    }
+    } else {}
   }
 }
