[NoCoverage] BlockStatement
src/Dicionarygenerator.ts:1:60
-export function Dicionarygenerator(word: string): number[] {
-  const dicionary: number[] = []
-  if (typeof word !== 'string') {
-    return dicionary
-  }
-  for (let i = 0; i < word.length * 2; i++) {
-    const numerRandon: number = Math.floor(Math.random() * 25) + 1
-    dicionary.push(numerRandon)
-  }
-
-  return dicionary
-}
+export function Dicionarygenerator(word: string): number[] {}
 export function DicionarygeneratorForTiwter(): number[] {
   const dicionary: number[] = []

[NoCoverage] ConditionalExpression
src/Dicionarygenerator.ts:3:7
 export function Dicionarygenerator(word: string): number[] {
   const dicionary: number[] = []
-  if (typeof word !== 'string') {
+  if (false) {
     return dicionary
   }

[NoCoverage] ConditionalExpression
src/Dicionarygenerator.ts:3:7
 export function Dicionarygenerator(word: string): number[] {
   const dicionary: number[] = []
-  if (typeof word !== 'string') {
+  if (true) {
     return dicionary
   }

[NoCoverage] ConditionalExpression
src/Dicionarygenerator.ts:6:19
   if (typeof word !== 'string') {
     return dicionary
   }
-  for (let i = 0; i < word.length * 2; i++) {
+  for (let i = 0; false; i++) {
     const numerRandon: number = Math.floor(Math.random() * 25) + 1
     dicionary.push(numerRandon)

[NoCoverage] UpdateOperator
src/Dicionarygenerator.ts:6:40
   if (typeof word !== 'string') {
     return dicionary
   }
-  for (let i = 0; i < word.length * 2; i++) {
+  for (let i = 0; i < word.length * 2; i--) {
     const numerRandon: number = Math.floor(Math.random() * 25) + 1
     dicionary.push(numerRandon)

[NoCoverage] ArithmeticOperator
src/Dicionarygenerator.ts:7:44
     return dicionary
   }
   for (let i = 0; i < word.length * 2; i++) {
-    const numerRandon: number = Math.floor(Math.random() * 25) + 1
+    const numerRandon: number = Math.floor(Math.random() / 25) + 1
     dicionary.push(numerRandon)
   }

[NoCoverage] ArithmeticOperator
src/Dicionarygenerator.ts:7:33
     return dicionary
   }
   for (let i = 0; i < word.length * 2; i++) {
-    const numerRandon: number = Math.floor(Math.random() * 25) + 1
+    const numerRandon: number = Math.floor(Math.random() * 25) - 1
     dicionary.push(numerRandon)
   }

[NoCoverage] BlockStatement
src/Dicionarygenerator.ts:13:57
 
   return dicionary
 }
-export function DicionarygeneratorForTiwter(): number[] {
-  const dicionary: number[] = []
-  for (let i = 0; i < 141; i++) {
-    const numerRandon: number = Math.floor(Math.random() * 25) + 1
-    dicionary.push(numerRandon)
-  }
-
-  return dicionary
-}
+export function DicionarygeneratorForTiwter(): number[] {}
 

[NoCoverage] ArrayDeclaration
src/Dicionarygenerator.ts:14:31
   return dicionary
 }
 export function DicionarygeneratorForTiwter(): number[] {
-  const dicionary: number[] = []
+  const dicionary: number[] = ["Stryker was here"]
   for (let i = 0; i < 141; i++) {
     const numerRandon: number = Math.floor(Math.random() * 25) + 1

[NoCoverage] EqualityOperator
src/Dicionarygenerator.ts:15:19
 }
 export function DicionarygeneratorForTiwter(): number[] {
   const dicionary: number[] = []
-  for (let i = 0; i < 141; i++) {
+  for (let i = 0; i >= 141; i++) {
     const numerRandon: number = Math.floor(Math.random() * 25) + 1
     dicionary.push(numerRandon)

[NoCoverage] EqualityOperator
src/Dicionarygenerator.ts:15:19
 }
 export function DicionarygeneratorForTiwter(): number[] {
   const dicionary: number[] = []
-  for (let i = 0; i < 141; i++) {
+  for (let i = 0; i <= 141; i++) {
     const numerRandon: number = Math.floor(Math.random() * 25) + 1
     dicionary.push(numerRandon)

[NoCoverage] ArithmeticOperator
src/Dicionarygenerator.ts:16:44
 export function DicionarygeneratorForTiwter(): number[] {
   const dicionary: number[] = []
   for (let i = 0; i < 141; i++) {
-    const numerRandon: number = Math.floor(Math.random() * 25) + 1
+    const numerRandon: number = Math.floor(Math.random() / 25) + 1
     dicionary.push(numerRandon)
   }

[NoCoverage] ArithmeticOperator
src/Dicionarygenerator.ts:16:33
 export function DicionarygeneratorForTiwter(): number[] {
   const dicionary: number[] = []
   for (let i = 0; i < 141; i++) {
-    const numerRandon: number = Math.floor(Math.random() * 25) + 1
+    const numerRandon: number = Math.floor(Math.random() * 25) - 1
     dicionary.push(numerRandon)
   }
