[Killed] BlockStatement
src/CessarEncryption.ts:3:75
 import { converNumberToString, moveNPlace } from './TransformWordinWordCodifig'
 
-export function cesarEncryption(word: string, encryption: number): string {
-  if (typeof word !== 'string') {
-    return ''
-  } else {
-    const WordToArry = word.split('')
-    const CodedWord: string[] = []
-    for (let i = 0; i < WordToArry.length; i++) {
-      const numeberToLetter = moveNPlace(WordToArry[i], encryption)
-
-      const codedLetter = converNumberToString(numeberToLetter)
-      CodedWord.push(codedLetter)
-    }
-    return CodedWord.join('')
-  }
-}
+export function cesarEncryption(word: string, encryption: number): string {}
 
killedBy: cesarEncryption  cesarEncryption [a,a,a] y 1 in bbb
statusReason: expected undefined to deeply equal 'bbb'

[Killed] EqualityOperator
src/CessarEncryption.ts:4:7
 import { converNumberToString, moveNPlace } from './TransformWordinWordCodifig'
 
 export function cesarEncryption(word: string, encryption: number): string {
-  if (typeof word !== 'string') {
+  if (typeof word === 'string') {
     return ''
   } else {
killedBy: cesarEncryption  cesarEncryption [a,a,a] y 1 in bbb
statusReason: expected '' to deeply equal 'bbb'

[Killed] BlockStatement
src/CessarEncryption.ts:4:33
 import { converNumberToString, moveNPlace } from './TransformWordinWordCodifig'
 
 export function cesarEncryption(word: string, encryption: number): string {
-  if (typeof word !== 'string') {
-    return ''
-  } else {
+  if (typeof word !== 'string') {} else {
     const WordToArry = word.split('')
     const CodedWord: string[] = []
killedBy: cesarEncryption  Transform [1,1,1] y [1,1,1] in [bbb]
statusReason: expected undefined to deeply equal ''

[Killed] BlockStatement
src/CessarEncryption.ts:6:10
 export function cesarEncryption(word: string, encryption: number): string {
   if (typeof word !== 'string') {
     return ''
-  } else {
-    const WordToArry = word.split('')
-    const CodedWord: string[] = []
-    for (let i = 0; i < WordToArry.length; i++) {
-      const numeberToLetter = moveNPlace(WordToArry[i], encryption)
-
-      const codedLetter = converNumberToString(numeberToLetter)
-      CodedWord.push(codedLetter)
-    }
-    return CodedWord.join('')
-  }
+  } else {}
 }
 
killedBy: cesarEncryption  cesarEncryption [a,a,a] y 1 in bbb
statusReason: expected undefined to deeply equal 'bbb'
