[Survived] StringLiteral
src/vigenere.ts:4:27
 export function vigenere(key: string, str: string, mode: string): string {
   const output: string[] = []
   let result = 0
-  let outputStr: string = ''
+  let outputStr: string = "Stryker was here!"
   if (
     typeof key !== 'string' ||

[Killed] ConditionalExpression
src/vigenere.ts:6:5
   let result = 0
   let outputStr: string = ''
   if (
-    typeof key !== 'string' ||
-    typeof str !== 'string' ||
-    typeof mode !== 'string'
+    true
   ) {
     return ''
killedBy: vigenere vigenere "aaa", "secret", "encrypt" in tfdsfu este
statusReason: expected '' to deeply equal 'TFDSFU'

[Killed] ConditionalExpression
src/vigenere.ts:6:5
   let result = 0
   let outputStr: string = ''
   if (
-    typeof key !== 'string' ||
-    typeof str !== 'string' ||
-    typeof mode !== 'string'
+    false
   ) {
     return ''
killedBy: vigenere  vigenere 2 in 2 params
statusReason: key.charCodeAt is not a function

[Killed] EqualityOperator
src/vigenere.ts:7:5
   let outputStr: string = ''
   if (
     typeof key !== 'string' ||
-    typeof str !== 'string' ||
+    typeof str === 'string' ||
     typeof mode !== 'string'
   ) {
killedBy: vigenere vigenere "aaa", "secret", "encrypt" in tfdsfu este
statusReason: expected '' to deeply equal 'TFDSFU'

[Survived] ConditionalExpression
src/vigenere.ts:7:5
   let outputStr: string = ''
   if (
     typeof key !== 'string' ||
-    typeof str !== 'string' ||
+    false ||
     typeof mode !== 'string'
   ) {

[Killed] EqualityOperator
src/vigenere.ts:8:5
   if (
     typeof key !== 'string' ||
     typeof str !== 'string' ||
-    typeof mode !== 'string'
+    typeof mode === 'string'
   ) {
     return ''
killedBy: vigenere vigenere "aaa", "secret", "encrypt" in tfdsfu este
statusReason: expected '' to deeply equal 'TFDSFU'

[Survived] ConditionalExpression
src/vigenere.ts:8:5
   if (
     typeof key !== 'string' ||
     typeof str !== 'string' ||
-    typeof mode !== 'string'
+    false
   ) {
     return ''

[Killed] BlockStatement
src/vigenere.ts:9:5
     typeof key !== 'string' ||
     typeof str !== 'string' ||
     typeof mode !== 'string'
-  ) {
-    return ''
-  } else {
+  ) {} else {
     for (let i = 0; i < str.length; i++) {
       if (mode === 'encrypt') {
killedBy: vigenere  vigenere 2 in 2 params
statusReason: expected undefined to deeply equal ''

[Killed] BlockStatement
src/vigenere.ts:11:10
     typeof mode !== 'string'
   ) {
     return ''
-  } else {
-    for (let i = 0; i < str.length; i++) {
-      if (mode === 'encrypt') {
-        result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
-        output[i] = String.fromCharCode(result)
-      } else if (mode === 'decrypt') {
-        if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {
-          result = str.charCodeAt(i) - key.charCodeAt(i % key.length) + 128
-        } else {
-          result = (str.charCodeAt(i) - key.charCodeAt(i % key.length)) % 128
-        }
-        output[i] = String.fromCharCode(result)
-      } else {
-        return ''
-      }
-    }
-    outputStr = output.join('')
-    return outputStr
-  }
+  } else {}
 }
 
killedBy: vigenere vigenere "aaa", "secret", "encrypt" in tfdsfu este
statusReason: expected undefined to deeply equal 'TFDSFU'

[Killed] ConditionalExpression
src/vigenere.ts:12:21
   ) {
     return ''
   } else {
-    for (let i = 0; i < str.length; i++) {
+    for (let i = 0; false; i++) {
       if (mode === 'encrypt') {
         result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
killedBy: vigenere vigenere "aaa", "secret", "encrypt" in tfdsfu este
statusReason: expected '' to deeply equal 'TFDSFU'

[Killed] BlockStatement
src/vigenere.ts:12:42
   ) {
     return ''
   } else {
-    for (let i = 0; i < str.length; i++) {
-      if (mode === 'encrypt') {
-        result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
-        output[i] = String.fromCharCode(result)
-      } else if (mode === 'decrypt') {
-        if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {
-          result = str.charCodeAt(i) - key.charCodeAt(i % key.length) + 128
-        } else {
-          result = (str.charCodeAt(i) - key.charCodeAt(i % key.length)) % 128
-        }
-        output[i] = String.fromCharCode(result)
-      } else {
-        return ''
-      }
-    }
+    for (let i = 0; i < str.length; i++) {}
     outputStr = output.join('')
     return outputStr
killedBy: vigenere vigenere "aaa", "secret", "encrypt" in tfdsfu este
statusReason: expected '' to deeply equal 'TFDSFU'

[Killed] BlockStatement
src/vigenere.ts:13:31
     return ''
   } else {
     for (let i = 0; i < str.length; i++) {
-      if (mode === 'encrypt') {
-        result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
-        output[i] = String.fromCharCode(result)
-      } else if (mode === 'decrypt') {
+      if (mode === 'encrypt') {} else if (mode === 'decrypt') {
         if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {
           result = str.charCodeAt(i) - key.charCodeAt(i % key.length) + 128
killedBy: vigenere vigenere "aaa", "secret", "encrypt" in tfdsfu este
statusReason: expected '' to deeply equal 'TFDSFU'

[Killed] ConditionalExpression
src/vigenere.ts:13:11
     return ''
   } else {
     for (let i = 0; i < str.length; i++) {
-      if (mode === 'encrypt') {
+      if (false) {
         result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
         output[i] = String.fromCharCode(result)
killedBy: vigenere vigenere "aaa", "secret", "encrypt" in tfdsfu este
statusReason: expected '' to deeply equal 'TFDSFU'

[Killed] ArithmeticOperator
src/vigenere.ts:14:54
   } else {
     for (let i = 0; i < str.length; i++) {
       if (mode === 'encrypt') {
-        result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
+        result = (str.charCodeAt(i) + key.charCodeAt(i * key.length)) % 128
         output[i] = String.fromCharCode(result)
       } else if (mode === 'decrypt') {
killedBy: vigenere vigenere "aaa", "secret", "encrypt" in tfdsfu este
statusReason: expected 'T\u0000\u0000\u0000\u0000\u0000' to deeply equal 'TFDSFU'

[Killed] ArithmeticOperator
src/vigenere.ts:14:18
   } else {
     for (let i = 0; i < str.length; i++) {
       if (mode === 'encrypt') {
-        result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
+        result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) * 128
         output[i] = String.fromCharCode(result)
       } else if (mode === 'decrypt') {
killedBy: vigenere vigenere "aaa", "secret", "encrypt" in tfdsfu este
statusReason: expected '樀挀戀榀挀檀' to deeply equal 'TFDSFU'

[Killed] ConditionalExpression
src/vigenere.ts:16:18
       if (mode === 'encrypt') {
         result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
         output[i] = String.fromCharCode(result)
-      } else if (mode === 'decrypt') {
+      } else if (false) {
         if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {
           result = str.charCodeAt(i) - key.charCodeAt(i % key.length) + 128
killedBy: vigenere  vigenere decrtypt to secret
statusReason: expected '' to deeply equal 'secret'

[Killed] BlockStatement
src/vigenere.ts:16:38
       if (mode === 'encrypt') {
         result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
         output[i] = String.fromCharCode(result)
-      } else if (mode === 'decrypt') {
-        if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {
-          result = str.charCodeAt(i) - key.charCodeAt(i % key.length) + 128
-        } else {
-          result = (str.charCodeAt(i) - key.charCodeAt(i % key.length)) % 128
-        }
-        output[i] = String.fromCharCode(result)
-      } else {
+      } else if (mode === 'decrypt') {} else {
         return ''
       }
killedBy: vigenere  vigenere decrtypt to secret
statusReason: expected '' to deeply equal 'secret'

[Killed] ArithmeticOperator
src/vigenere.ts:17:48
         result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
         output[i] = String.fromCharCode(result)
       } else if (mode === 'decrypt') {
-        if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {
+        if (str.charCodeAt(i) - key.charCodeAt(i * key.length) < 0) {
           result = str.charCodeAt(i) - key.charCodeAt(i % key.length) + 128
         } else {
killedBy: vigenere  vigenere decrtypt to secret
statusReason: expected 's￥￣\ufff2￥\ufff4' to deeply equal 'secret'

[Killed] BlockStatement
src/vigenere.ts:17:69
         result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
         output[i] = String.fromCharCode(result)
       } else if (mode === 'decrypt') {
-        if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {
-          result = str.charCodeAt(i) - key.charCodeAt(i % key.length) + 128
-        } else {
+        if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {} else {
           result = (str.charCodeAt(i) - key.charCodeAt(i % key.length)) % 128
         }
killedBy: vigenere  vigenere decrtypt to secret
statusReason: expected '\u0000\u0000\u0000\u0000\u0000\u0000' to deeply equal 'secret'

[Killed] ArithmeticOperator
src/vigenere.ts:18:55
         output[i] = String.fromCharCode(result)
       } else if (mode === 'decrypt') {
         if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {
-          result = str.charCodeAt(i) - key.charCodeAt(i % key.length) + 128
+          result = str.charCodeAt(i) - key.charCodeAt(i * key.length) + 128
         } else {
           result = (str.charCodeAt(i) - key.charCodeAt(i % key.length)) % 128
killedBy: vigenere  vigenere decrtypt to secret
statusReason: expected 's\u0000\u0000\u0000\u0000\u0000' to deeply equal 'secret'

[Killed] ArithmeticOperator
src/vigenere.ts:18:20
         output[i] = String.fromCharCode(result)
       } else if (mode === 'decrypt') {
         if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {
-          result = str.charCodeAt(i) - key.charCodeAt(i % key.length) + 128
+          result = str.charCodeAt(i) - key.charCodeAt(i % key.length) - 128
         } else {
           result = (str.charCodeAt(i) - key.charCodeAt(i % key.length)) % 128
killedBy: vigenere  vigenere decrtypt to secret
statusReason: expected 'ｳ･｣ｲ･ｴ' to deeply equal 'secret'

[NoCoverage] BlockStatement
src/vigenere.ts:19:16
       } else if (mode === 'decrypt') {
         if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {
           result = str.charCodeAt(i) - key.charCodeAt(i % key.length) + 128
-        } else {
-          result = (str.charCodeAt(i) - key.charCodeAt(i % key.length)) % 128
-        }
+        } else {}
         output[i] = String.fromCharCode(result)
       } else {

[NoCoverage] ArithmeticOperator
src/vigenere.ts:20:21
         if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {
           result = str.charCodeAt(i) - key.charCodeAt(i % key.length) + 128
         } else {
-          result = (str.charCodeAt(i) - key.charCodeAt(i % key.length)) % 128
+          result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
         }
         output[i] = String.fromCharCode(result)

[NoCoverage] ArithmeticOperator
src/vigenere.ts:20:20
         if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {
           result = str.charCodeAt(i) - key.charCodeAt(i % key.length) + 128
         } else {
-          result = (str.charCodeAt(i) - key.charCodeAt(i % key.length)) % 128
+          result = (str.charCodeAt(i) - key.charCodeAt(i % key.length)) * 128
         }
         output[i] = String.fromCharCode(result)

[NoCoverage] BlockStatement
src/vigenere.ts:23:14
           result = (str.charCodeAt(i) - key.charCodeAt(i % key.length)) % 128
         }
         output[i] = String.fromCharCode(result)
-      } else {
-        return ''
-      }
+      } else {}
     }
     outputStr = output.join('')

[NoCoverage] StringLiteral
src/vigenere.ts:24:16
         }
         output[i] = String.fromCharCode(result)
       } else {
-        return ''
+        return "Stryker was here!"
       }
     }
