[Killed] BlockStatement
src/TransformWordinWordCodifig.ts:29:56
   y: 24,
   z: 25
 }
-export function converStrinToNumber(s: string): number {
-  let totalValue: number = 0
-  const lowerCaseS = s.toLowerCase()
-
-  for (const later in abcInNumber) {
-    if (later === lowerCaseS) {
-      totalValue = abcInNumber[later]
-      break
-    }
-  }
-  return totalValue
-}
+export function converStrinToNumber(s: string): number {}
 export function moveNPlace(s: string, n: number): number {
   const numberOriginal: number = converStrinToNumber(s)
killedBy: cesarEncryption  cesarEncryption [a,a,a] y 1 in bbb
statusReason: expected '' to deeply equal 'bbb'

[Killed] MethodExpression
src/TransformWordinWordCodifig.ts:31:22
 }
 export function converStrinToNumber(s: string): number {
   let totalValue: number = 0
-  const lowerCaseS = s.toLowerCase()
+  const lowerCaseS = s.toUpperCase()
 
   for (const later in abcInNumber) {
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected '' to deeply equal 'rdbqdsn'

[Killed] BlockStatement
src/TransformWordinWordCodifig.ts:33:36
   let totalValue: number = 0
   const lowerCaseS = s.toLowerCase()
 
-  for (const later in abcInNumber) {
-    if (later === lowerCaseS) {
-      totalValue = abcInNumber[later]
-      break
-    }
-  }
+  for (const later in abcInNumber) {}
   return totalValue
 }
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected '' to deeply equal 'rdbqdsn'

[Killed] EqualityOperator
src/TransformWordinWordCodifig.ts:34:9
   const lowerCaseS = s.toLowerCase()
 
   for (const later in abcInNumber) {
-    if (later === lowerCaseS) {
+    if (later !== lowerCaseS) {
       totalValue = abcInNumber[later]
       break
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected '' to deeply equal 'rdbqdsn'

[Killed] ConditionalExpression
src/TransformWordinWordCodifig.ts:34:9
   const lowerCaseS = s.toLowerCase()
 
   for (const later in abcInNumber) {
-    if (later === lowerCaseS) {
+    if (false) {
       totalValue = abcInNumber[later]
       break
killedBy: cesarEncryption  cesarEncryption [a,a,a] y 1 in bbb
statusReason: expected 'aaa' to deeply equal 'bbb'

[Killed] BlockStatement
src/TransformWordinWordCodifig.ts:41:58
   }
   return totalValue
 }
-export function moveNPlace(s: string, n: number): number {
-  const numberOriginal: number = converStrinToNumber(s)
-
-  return numberOriginal + n
-}
+export function moveNPlace(s: string, n: number): number {}
 export function moveNPlaceReverse(s: string, n: number): number {
   const numberOriginal: number = converStrinToNumber(s)
killedBy: moveNPalabra  Transform [1,1,1] y [1,1,1] in [bbb]
statusReason: expected '' to deeply equal 'secreto'

[Killed] ArithmeticOperator
src/TransformWordinWordCodifig.ts:44:10
 export function moveNPlace(s: string, n: number): number {
   const numberOriginal: number = converStrinToNumber(s)
 
-  return numberOriginal + n
+  return numberOriginal - n
 }
 export function moveNPlaceReverse(s: string, n: number): number {
killedBy: cesarEncryption  cesarEncryption [a,a,a] y 1 in bbb
statusReason: expected '' to deeply equal 'bbb'

[Killed] BlockStatement
src/TransformWordinWordCodifig.ts:46:65
 
   return numberOriginal + n
 }
-export function moveNPlaceReverse(s: string, n: number): number {
-  const numberOriginal: number = converStrinToNumber(s)
-
-  return numberOriginal - n
-}
+export function moveNPlaceReverse(s: string, n: number): number {}
 export function converNumberToString(n: number): string {
   let codedLetter: string = ''
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected '' to deeply equal 'rdbqdsn'

[Killed] ArithmeticOperator
src/TransformWordinWordCodifig.ts:49:10
 export function moveNPlaceReverse(s: string, n: number): number {
   const numberOriginal: number = converStrinToNumber(s)
 
-  return numberOriginal - n
+  return numberOriginal + n
 }
 export function converNumberToString(n: number): string {
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected 'tfdsfup' to deeply equal 'rdbqdsn'

[Killed] BlockStatement
src/TransformWordinWordCodifig.ts:51:57
 
   return numberOriginal - n
 }
-export function converNumberToString(n: number): string {
-  let codedLetter: string = ''
-  for (const later in abcInNumber) {
-    if (abcInNumber[later] === n) {
-      codedLetter = later
-      break
-    }
-  }
-  return codedLetter
-}
+export function converNumberToString(n: number): string {}
 export function moveNWord(
   word: string,
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected '' to deeply equal 'rdbqdsn'

[Killed] BlockStatement
src/TransformWordinWordCodifig.ts:53:36
 }
 export function converNumberToString(n: number): string {
   let codedLetter: string = ''
-  for (const later in abcInNumber) {
-    if (abcInNumber[later] === n) {
-      codedLetter = later
-      break
-    }
-  }
+  for (const later in abcInNumber) {}
   return codedLetter
 }
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected '' to deeply equal 'rdbqdsn'

[Killed] ConditionalExpression
src/TransformWordinWordCodifig.ts:54:9
 export function converNumberToString(n: number): string {
   let codedLetter: string = ''
   for (const later in abcInNumber) {
-    if (abcInNumber[later] === n) {
+    if (false) {
       codedLetter = later
       break
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected '' to deeply equal 'rdbqdsn'

[Killed] EqualityOperator
src/TransformWordinWordCodifig.ts:54:9
 export function converNumberToString(n: number): string {
   let codedLetter: string = ''
   for (const later in abcInNumber) {
-    if (abcInNumber[later] === n) {
+    if (abcInNumber[later] !== n) {
       codedLetter = later
       break
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected 'aaaaaaa' to deeply equal 'rdbqdsn'

[Killed] ConditionalExpression
src/TransformWordinWordCodifig.ts:66:7
   dicionary: number[],
   mode: string
 ): string {
-  if (mode === 'encrypt') {
+  if (false) {
     if (typeof word !== 'string') {
       return ''
killedBy: moveNPalabra  Transform [1,1,1] y [1,1,1] in [bbb]
statusReason: expected '' to deeply equal 'secreto'

[Killed] EqualityOperator
src/TransformWordinWordCodifig.ts:66:7
   dicionary: number[],
   mode: string
 ): string {
-  if (mode === 'encrypt') {
+  if (mode !== 'encrypt') {
     if (typeof word !== 'string') {
       return ''
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected 'tfdsfup' to deeply equal 'rdbqdsn'

[Killed] BlockStatement
src/TransformWordinWordCodifig.ts:67:35
   mode: string
 ): string {
   if (mode === 'encrypt') {
-    if (typeof word !== 'string') {
-      return ''
-    } else {
+    if (typeof word !== 'string') {} else {
       const WordToArry = word.split('')
       const CodedWord: string[] = []
killedBy: moveNPalabra  Transform [1,1,1] y [1,1,1] in [bbb]
statusReason: expected undefined to deeply equal ''

[Killed] ConditionalExpression
src/TransformWordinWordCodifig.ts:67:9
   mode: string
 ): string {
   if (mode === 'encrypt') {
-    if (typeof word !== 'string') {
+    if (false) {
       return ''
     } else {
killedBy: moveNPalabra  Transform [1,1,1] y [1,1,1] in [bbb]
statusReason: word.split is not a function

[Killed] StringLiteral
src/TransformWordinWordCodifig.ts:68:14
 ): string {
   if (mode === 'encrypt') {
     if (typeof word !== 'string') {
-      return ''
+      return "Stryker was here!"
     } else {
       const WordToArry = word.split('')
killedBy: moveNPalabra  Transform [1,1,1] y [1,1,1] in [bbb]
statusReason: expected 'Stryker was here!' to deeply equal ''

[Killed] BlockStatement
src/TransformWordinWordCodifig.ts:69:12
   if (mode === 'encrypt') {
     if (typeof word !== 'string') {
       return ''
-    } else {
-      const WordToArry = word.split('')
-      const CodedWord: string[] = []
-      for (let i = 0; i < WordToArry.length; i++) {
-        const numeberToLetter = moveNPlace(WordToArry[i], dicionary[i])
-
-        const codedLetter = converNumberToString(numeberToLetter)
-        CodedWord.push(codedLetter)
-      }
-      return CodedWord.join('')
-    }
+    } else {}
   } else if (mode === 'decrypt') {
     if (typeof word !== 'string') {
killedBy: moveNPalabra  Transform [1,1,1] y [1,1,1] in [bbb]
statusReason: expected undefined to deeply equal 'secreto'

[Killed] EqualityOperator
src/TransformWordinWordCodifig.ts:72:23
     } else {
       const WordToArry = word.split('')
       const CodedWord: string[] = []
-      for (let i = 0; i < WordToArry.length; i++) {
+      for (let i = 0; i <= WordToArry.length; i++) {
         const numeberToLetter = moveNPlace(WordToArry[i], dicionary[i])
 
killedBy: moveNPalabra  Transform [1,1,1] y [1,1,1] in [bbb]
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ConditionalExpression
src/TransformWordinWordCodifig.ts:72:23
     } else {
       const WordToArry = word.split('')
       const CodedWord: string[] = []
-      for (let i = 0; i < WordToArry.length; i++) {
+      for (let i = 0; false; i++) {
         const numeberToLetter = moveNPlace(WordToArry[i], dicionary[i])
 
killedBy: moveNPalabra  Transform [1,1,1] y [1,1,1] in [bbb]
statusReason: expected '' to deeply equal 'secreto'

[Killed] ConditionalExpression
src/TransformWordinWordCodifig.ts:80:14
       }
       return CodedWord.join('')
     }
-  } else if (mode === 'decrypt') {
+  } else if (false) {
     if (typeof word !== 'string') {
       return ''
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected '' to deeply equal 'rdbqdsn'

[Killed] BlockStatement
src/TransformWordinWordCodifig.ts:80:34
       }
       return CodedWord.join('')
     }
-  } else if (mode === 'decrypt') {
-    if (typeof word !== 'string') {
-      return ''
-    } else {
-      const WordToArry = word.split('')
-      const CodedWord: string[] = []
-      for (let i = 0; i < WordToArry.length; i++) {
-        const numeberToLetter = moveNPlaceReverse(WordToArry[i], dicionary[i])
-
-        const codedLetter = converNumberToString(numeberToLetter)
-        CodedWord.push(codedLetter)
-      }
-      return CodedWord.join('')
-    }
-  } else {
+  } else if (mode === 'decrypt') {} else {
     return ''
   }
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected undefined to deeply equal 'rdbqdsn'

[Killed] BlockStatement
src/TransformWordinWordCodifig.ts:81:35
       return CodedWord.join('')
     }
   } else if (mode === 'decrypt') {
-    if (typeof word !== 'string') {
-      return ''
-    } else {
+    if (typeof word !== 'string') {} else {
       const WordToArry = word.split('')
       const CodedWord: string[] = []
killedBy: moveNPalabra  Transform [1,1,1] y [1,1,1] in [bbb]
statusReason: expected undefined to deeply equal ''

[Killed] EqualityOperator
src/TransformWordinWordCodifig.ts:81:9
       return CodedWord.join('')
     }
   } else if (mode === 'decrypt') {
-    if (typeof word !== 'string') {
+    if (typeof word === 'string') {
       return ''
     } else {
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected '' to deeply equal 'rdbqdsn'

[Killed] BlockStatement
src/TransformWordinWordCodifig.ts:83:12
   } else if (mode === 'decrypt') {
     if (typeof word !== 'string') {
       return ''
-    } else {
-      const WordToArry = word.split('')
-      const CodedWord: string[] = []
-      for (let i = 0; i < WordToArry.length; i++) {
-        const numeberToLetter = moveNPlaceReverse(WordToArry[i], dicionary[i])
-
-        const codedLetter = converNumberToString(numeberToLetter)
-        CodedWord.push(codedLetter)
-      }
-      return CodedWord.join('')
-    }
+    } else {}
   } else {
     return ''
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected undefined to deeply equal 'rdbqdsn'

[Killed] StringLiteral
src/TransformWordinWordCodifig.ts:84:37
     if (typeof word !== 'string') {
       return ''
     } else {
-      const WordToArry = word.split('')
+      const WordToArry = word.split("Stryker was here!")
       const CodedWord: string[] = []
       for (let i = 0; i < WordToArry.length; i++) {
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected '' to deeply equal 'rdbqdsn'

[Killed] ArrayDeclaration
src/TransformWordinWordCodifig.ts:85:35
       return ''
     } else {
       const WordToArry = word.split('')
-      const CodedWord: string[] = []
+      const CodedWord: string[] = ["Stryker was here"]
       for (let i = 0; i < WordToArry.length; i++) {
         const numeberToLetter = moveNPlaceReverse(WordToArry[i], dicionary[i])
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected 'Stryker was hererdbqdsn' to deeply equal 'rdbqdsn'

[Killed] EqualityOperator
src/TransformWordinWordCodifig.ts:86:23
     } else {
       const WordToArry = word.split('')
       const CodedWord: string[] = []
-      for (let i = 0; i < WordToArry.length; i++) {
+      for (let i = 0; i >= WordToArry.length; i++) {
         const numeberToLetter = moveNPlaceReverse(WordToArry[i], dicionary[i])
 
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected '' to deeply equal 'rdbqdsn'

[Killed] UpdateOperator
src/TransformWordinWordCodifig.ts:86:46
     } else {
       const WordToArry = word.split('')
       const CodedWord: string[] = []
-      for (let i = 0; i < WordToArry.length; i++) {
+      for (let i = 0; i < WordToArry.length; i--) {
         const numeberToLetter = moveNPlaceReverse(WordToArry[i], dicionary[i])
 
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] BlockStatement
src/TransformWordinWordCodifig.ts:94:10
       }
       return CodedWord.join('')
     }
-  } else {
-    return ''
-  }
+  } else {}
 }
 
killedBy: moveNPalabra  Transform [1,1,1] y [1,1,1] in [bbb]
statusReason: expected undefined to deeply equal ''
