[Killed] LogicalOperator
src/vigenere.ts:3:5
 export function vigenere(key: string, str: string, mode: string): string {
   if (
-    typeof key !== 'string' ||
-    typeof str !== 'string' ||
+    typeof key !== 'string' && typeof str !== 'string' ||
     typeof mode !== 'string'
   ) {
killedBy: vigenere  vigenere 2 in 2 params
statusReason: key.charCodeAt is not a function

[Killed] BlockStatement
src/vigenere.ts:8:10
     typeof mode !== 'string'
   ) {
     return ''
-  } else {
-    const output: string[] = []
-    let result = 0
-    let outputStr: string = ''
-
-    for (let i = 0; i < str.length; i++) {
-      if (mode === 'encrypt') {
-        result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
-        output[i] = String.fromCharCode(result)
-      } else if (mode === 'decrypt') {
-        if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {
-          result = str.charCodeAt(i) - key.charCodeAt(i % key.length) + 128
-        } else {
-          result = (str.charCodeAt(i) - key.charCodeAt(i % key.length)) % 128
-        }
-        output[i] = String.fromCharCode(result)
-      } else {
-        return ''
-      }
-    }
-    outputStr = output.join('')
-    return outputStr
-  }
+  } else {}
 }
 
killedBy: vigenere vigenere "aaa", "secret", "encrypt" in tfdsfu este
statusReason: expected undefined to deeply equal 'TFDSFU'

[Killed] ConditionalExpression
src/vigenere.ts:13:21
     let result = 0
     let outputStr: string = ''
 
-    for (let i = 0; i < str.length; i++) {
+    for (let i = 0; false; i++) {
       if (mode === 'encrypt') {
         result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
killedBy: vigenere vigenere "aaa", "secret", "encrypt" in tfdsfu este
statusReason: expected '' to deeply equal 'TFDSFU'

[Killed] BlockStatement
src/vigenere.ts:13:42
     let result = 0
     let outputStr: string = ''
 
-    for (let i = 0; i < str.length; i++) {
-      if (mode === 'encrypt') {
-        result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
-        output[i] = String.fromCharCode(result)
-      } else if (mode === 'decrypt') {
-        if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {
-          result = str.charCodeAt(i) - key.charCodeAt(i % key.length) + 128
-        } else {
-          result = (str.charCodeAt(i) - key.charCodeAt(i % key.length)) % 128
-        }
-        output[i] = String.fromCharCode(result)
-      } else {
-        return ''
-      }
-    }
+    for (let i = 0; i < str.length; i++) {}
     outputStr = output.join('')
     return outputStr
killedBy: vigenere vigenere "aaa", "secret", "encrypt" in tfdsfu este
statusReason: expected '' to deeply equal 'TFDSFU'

[Killed] ConditionalExpression
src/vigenere.ts:14:11
     let outputStr: string = ''
 
     for (let i = 0; i < str.length; i++) {
-      if (mode === 'encrypt') {
+      if (true) {
         result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
         output[i] = String.fromCharCode(result)
killedBy: vigenere  vigenere decrtypt to secret
statusReason: expected '5\'%4\'6' to deeply equal 'secret'

[Killed] EqualityOperator
src/vigenere.ts:14:11
     let outputStr: string = ''
 
     for (let i = 0; i < str.length; i++) {
-      if (mode === 'encrypt') {
+      if (mode !== 'encrypt') {
         result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
         output[i] = String.fromCharCode(result)
killedBy: vigenere vigenere "aaa", "secret", "encrypt" in tfdsfu este
statusReason: expected '' to deeply equal 'TFDSFU'

[Killed] EqualityOperator
src/vigenere.ts:17:18
       if (mode === 'encrypt') {
         result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
         output[i] = String.fromCharCode(result)
-      } else if (mode === 'decrypt') {
+      } else if (mode !== 'decrypt') {
         if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {
           result = str.charCodeAt(i) - key.charCodeAt(i % key.length) + 128
killedBy: vigenere  vigenere decrtypt to secret
statusReason: expected '' to deeply equal 'secret'

[Killed] ArithmeticOperator
src/vigenere.ts:18:13
         result = (str.charCodeAt(i) + key.charCodeAt(i % key.length)) % 128
         output[i] = String.fromCharCode(result)
       } else if (mode === 'decrypt') {
-        if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {
+        if (str.charCodeAt(i) + key.charCodeAt(i % key.length) < 0) {
           result = str.charCodeAt(i) - key.charCodeAt(i % key.length) + 128
         } else {
killedBy: vigenere  vigenere decrtypt to secret
statusReason: expected '\ufff3￥￣\ufff2￥\ufff4' to deeply equal 'secret'

[Killed] ArithmeticOperator
src/vigenere.ts:19:20
         output[i] = String.fromCharCode(result)
       } else if (mode === 'decrypt') {
         if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {
-          result = str.charCodeAt(i) - key.charCodeAt(i % key.length) + 128
+          result = str.charCodeAt(i) + key.charCodeAt(i % key.length) + 128
         } else {
           result = (str.charCodeAt(i) - key.charCodeAt(i % key.length)) % 128
killedBy: vigenere  vigenere decrtypt to secret
statusReason: expected 'ĵħĥĴħĶ' to deeply equal 'secret'

[NoCoverage] ArithmeticOperator
src/vigenere.ts:21:56
         if (str.charCodeAt(i) - key.charCodeAt(i % key.length) < 0) {
           result = str.charCodeAt(i) - key.charCodeAt(i % key.length) + 128
         } else {
-          result = (str.charCodeAt(i) - key.charCodeAt(i % key.length)) % 128
+          result = (str.charCodeAt(i) - key.charCodeAt(i * key.length)) % 128
         }
         output[i] = String.fromCharCode(result)
