[Killed] BlockStatement
src/TransformWordinWordCodifig.ts:56:70
   }
   return codedLetter
 }
-export function moveNWord(word: string, dicionary: number[]): string {
-  if (typeof word !== 'string') {
-    return ''
-  } else {
-    const WordToArry = word.split('')
-    const CodedWord: string[] = []
-    for (let i = 0; i < WordToArry.length; i++) {
-      const numeberToLetter = moveNPlace(WordToArry[i], dicionary[i])
-
-      const codedLetter = converNumberToString(numeberToLetter)
-      CodedWord.push(codedLetter)
-    }
-    return CodedWord.join('')
-  }
-}
+export function moveNWord(word: string, dicionary: number[]): string {}
 
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected undefined to deeply equal 'bbb'

[Killed] EqualityOperator
src/TransformWordinWordCodifig.ts:57:7
   return codedLetter
 }
 export function moveNWord(word: string, dicionary: number[]): string {
-  if (typeof word !== 'string') {
+  if (typeof word === 'string') {
     return ''
   } else {
killedBy: moveNPalabra  Transform [a,a,a] y [1,1,1] in [bbb]
statusReason: expected '' to deeply equal 'bbb'

[Killed] BlockStatement
src/TransformWordinWordCodifig.ts:57:33
   return codedLetter
 }
 export function moveNWord(word: string, dicionary: number[]): string {
-  if (typeof word !== 'string') {
-    return ''
-  } else {
+  if (typeof word !== 'string') {} else {
     const WordToArry = word.split('')
     const CodedWord: string[] = []
killedBy: moveNPalabra  Transform [1,1,1] y [1,1,1] in [bbb]
statusReason: expected undefined to deeply equal ''
